# day1
프론트엔드 개발자 교육 1일차 환경 세팅 및 첫 HTML 페이지

#Frontend Day 1

프론트엔드 개발자 교육 1일차  
오리엔테이션 및 HTML 기본 구조와 개발 환경 세팅

---

## 오늘 한 일
- VSCode, Node.js 설치
- index.html 파일 작성
- Node.js, VSCode, Prettier, Live Server 세팅 및 도구 설치 
- Git, GitHub 계정 생성 및 설치
- Git,GitHub 는 개인적으로 생성 및 설치를 한것이라 연동이 아직 많이 어려웠습니다.
추후 오늘내일 이후로 시간이 날때마다 개인적으로 계속 알아보며 해결 해 나갈것

## 개발 환경
- Node.js v20.18.0    
- VSCode + Prettier / Live Server 확장

-

 

오늘의 느낀 점

터미널 연동 및 명령어 사용이 아직 익숙하지 않지만, 따라 하면서 원리를 조금 알게 되었습니다.

그러나 아직  경험 과 지식이 부족하다보니 연동 자체만으로도 많이 힘겹습니다.
그러나 GitHub에 첫 작성 한것을 보니 뿌듯함이 느껴지고 , 조금 더 배우고 시간이 지났을때 저의 모습이 궁금 해졌습니다. 

앞으로 하루하루 기록을 남겨서 저만의 나 자신만 의 성장 노트를 만들 예정 입니다.
